In [1]:
import numpy as np
import pandas as pd

import requests
from bs4 import BeautifulSoup

# import json
# import re
# import pprint

import cx_Oracle
from sqlalchemy import create_engine

import warnings
warnings.filterwarnings(action='ignore')

In [2]:
#!pip install sqlalchemy

# 뷰티풀소프
https://www.crummy.com/software/BeautifulSoup/bs4/doc/

파서종류
"html.parser"
"xml"
"lxml"
"html5lib"

In [3]:
html_doc = """<html><head><title>The Dormouse's story</title></head>
<body>
<p class="title"><b>The Dormouse's story</b></p>

<p class="story">Once upon a time there were three little sisters; and their names were
<a href="http://example.com/elsie" class="sister" id="link1">Elsie</a>,
<a href="http://example.com/lacie" class="sister" id="link2">Lacie</a> and
<a href="http://example.com/tillie" class="sister" id="link3">Tillie</a>;
and they lived at the bottom of a well.</p>

<p class="story">...</p>
"""
soup = BeautifulSoup(html_doc, 'html.parser')
print(soup.prettify())

<html>
 <head>
  <title>
   The Dormouse's story
  </title>
 </head>
 <body>
  <p class="title">
   <b>
    The Dormouse's story
   </b>
  </p>
  <p class="story">
   Once upon a time there were three little sisters; and their names were
   <a class="sister" href="http://example.com/elsie" id="link1">
    Elsie
   </a>
   ,
   <a class="sister" href="http://example.com/lacie" id="link2">
    Lacie
   </a>
   and
   <a class="sister" href="http://example.com/tillie" id="link3">
    Tillie
   </a>
   ;
and they lived at the bottom of a well.
  </p>
  <p class="story">
   ...
  </p>
 </body>
</html>

In [4]:
soup.title.text

"The Dormouse's story"

In [5]:
soup.p['class']

['title']

In [6]:
soup.find_all('a')

[<a class="sister" href="http://example.com/elsie" id="link1">Elsie</a>,
 <a class="sister" href="http://example.com/lacie" id="link2">Lacie</a>,
 <a class="sister" href="http://example.com/tillie" id="link3">Tillie</a>]

In [7]:
for link in soup.find_all('a'):
    print(link.get('href'))

http://example.com/elsie
http://example.com/lacie
http://example.com/tillie

In [8]:
for link in soup.find_all('a'):
    print(link['href'])
# 이렇게 잘 안씀

http://example.com/elsie
http://example.com/lacie
http://example.com/tillie

In [9]:
for link in soup.find_all('a'):
    print(link.text)

Elsie
Lacie
Tillie

In [10]:
for link in soup.find_all('a'):
    print(link.get_text())
# ?

Elsie
Lacie
Tillie

# 크롤링(Crawling)

In [11]:
li_list = soup.select("div#nav_content > div:nth-child(1) > ul > li")
print(len(li_list))
# print(li_list)
for li in li_list:
    title = li.select_one("a > div > span").text
    print(title)

0

In [18]:
res = requests.get('https://www.ytn.co.kr/news/list.php?mcd=0102')
print(res.status_code)
soup = BeautifulSoup(res.text, 'html.parser')
li_list = soup.select("#nav_content > div:nth-child(1) > ul > li")


new_list = []
for li in li_list:
    title = li.select_one('a > div > span').text
    regdate = li.select_one('a > div > div > span.date').text
    contents = li.select_one('a > div > div > span.desc').text
    href = li.select_one('a').get('href')
    new_list.append([title,regdate,contents,href])
    
df = pd.DataFrame(new_list, columns=[['title', 'regdate', 'contents', 'href']])
df.head()

200

,title,regdate,contents,href
0,"[생생경제] 배달앱 소비자 불만 증가, 제일 큰 불만 사항은?",2023-02-24 15:30,■ 방송 : YTN 라디오 FM 94.5 (15:00~16:00)\r\n■ 진행 :...,https://www.ytn.co.kr/_ln/0102_202302241531028641
1,"한전 지난해 32.6조 원 적자...""연료 가격 급등 영향""",2023-02-24 14:50,LNG 등 연료 가격이 급등하면서 지난해 한국전력의 적자가 32조 원을 넘은 것으로...,https://www.ytn.co.kr/_ln/0102_202302241450227781
2,"한전 지난해 32.6조 원 적자...""연료 가격 급등 영향""",2023-02-24 14:23,LNG 등 연료 가격 급등의 영향으로 지난해 한국전력의 적자가 32조 원을 넘은 것...,https://www.ytn.co.kr/_ln/0102_202302241423288168
3,농산물 온라인 도매시장 11월 30일 문 연다...준비 착수,2023-02-24 14:22,전국 단위의 농산물 온라인도매시장이 오는 11월 30일 문을 엽니다.\r\n\r\n...,https://www.ytn.co.kr/_ln/0102_202302241422320234
4,"국세청·관세청, 모범 납세 수출기업 공동 세정지원",2023-02-24 14:19,국세청과 관세청이 각 기관에서 선정한 모범 납세 수출기업 명단을 교환해 만여 개 기...,https://www.ytn.co.kr/_ln/0102_202302241419217389

https://s.search.naver.com/p/intentblock/search.naver?nlu_query=%7B%22v%22%3A%223%22%2C%22intentblock%22%3A%221%22%2C%22qid%22%3A%22%EC%A0%9C%EC%A3%BC%EB%8F%84%EB%A7%9B%EC%A7%91%22%2C%22abt%22%3A%5B%7B%22eid%22%3A%22SBR1%22%2C%22value%22%3A%7B%22bucket%22%3A%22T4%22%2C%22is_control%22%3Afalse%7D%7D%5D%2C%22matchedAbt%22%3A%5B%7B%22eid%22%3A%22SBR1%22%2C%22value%22%3A%7B%22bucket%22%3A%22T4%22%2C%22is_control%22%3Afalse%7D%7D%5D%7D&query=%EC%A0%9C%EC%A3%BC%EB%8F%84+%EB%A7%9B%EC%A7%91&where=nx_blocks_bridge

In [13]:
#이미지 제목 링크

In [14]:
res = requests.get('https://s.search.naver.com/p/intentblock/search.naver?nlu_query=%7B%22v%22%3A%223%22%2C%22intentblock%22%3A%221%22%2C%22qid%22%3A%22%EC%A0%9C%EC%A3%BC%EB%8F%84%EB%A7%9B%EC%A7%91%22%2C%22abt%22%3A%5B%7B%22eid%22%3A%22SBR1%22%2C%22value%22%3A%7B%22bucket%22%3A%22T4%22%2C%22is_control%22%3Afalse%7D%7D%5D%2C%22matchedAbt%22%3A%5B%7B%22eid%22%3A%22SBR1%22%2C%22value%22%3A%7B%22bucket%22%3A%22T4%22%2C%22is_control%22%3Afalse%7D%7D%5D%7D&query=%EC%A0%9C%EC%A3%BC%EB%8F%84+%EB%A7%9B%EC%A7%91&where=nx_blocks_bridge')
print(res.status_code)
soup = BeautifulSoup(res.text, 'html.parser')
div_list = soup.select("#content > section > div > div.popular_grid_wrap.group_popular_block._au_popular_root > div")

food_list = []
for div in div_list:
    img = div.select_one('a > div > div.thumb_area > div.thumb > div > img').get('src')
    title = div.select_one('a > div > div.dsc_area > div').text
    link = div.select_one('a').get('href')
    food_list.append([img, title, link])

df = pd.DataFrame(food_list, columns=[['img', 'title', 'link']])
df

200

,img,title,link
0,https://search.pstatic.net/common/?src=https%3...,반응 좋은 맛집 후기,https://s.search.naver.com/p/intentblock/searc...
1,https://search.pstatic.net/common/?src=http%3A...,TV 속 맛집 후기,https://s.search.naver.com/p/intentblock/searc...
2,https://search.pstatic.net/common/?src=https%3...,맛집 탐방가 리뷰,https://s.search.naver.com/p/intentblock/searc...
3,https://search.pstatic.net/common/?src=http%3A...,제주도맛집내돈내산,https://s.search.naver.com/p/intentblock/searc...
4,https://search.pstatic.net/common/?src=http%3A...,제주도맛집추천,https://s.search.naver.com/p/intentblock/searc...
...,...,...,...
76,https://search.pstatic.net/common/?src=http%3A...,제주도백반,https://s.search.naver.com/p/intentblock/searc...
77,https://search.pstatic.net/common/?src=http%3A...,제주도쌍둥이횟집,https://s.search.naver.com/p/intentblock/searc...
78,https://search.pstatic.net/common/?src=http%3A...,제주도안덕면맛집,https://s.search.naver.com/p/intentblock/searc...
79,https://search.pstatic.net/common/?src=http%3A...,제주도 맛집 추천,https://s.search.naver.com/p/intentblock/searc...
80,https://search.pstatic.net/common/?src=http%3A...,제주도형제도식당,https://s.search.naver.com/p/intentblock/searc...

# DB
<pre>
주의사항 conn.close()을 잊어서 conn에러 시
윈도우
서비스
서순중요
OracleXETNSListener 정지
OracleServiceXE 정지
OracleServiceXE 실행
OracleXETNSListener 실행

## DB에서 가져오기 강추강추
```
def read_sql(
    sql, #핵심
    con, #핵심
    
    index_col: str | list[str] | None = None,
    coerce_float: bool = True,
    params=None,
    parse_dates=None,
    columns: list[str] | None = None,
    chunksize: int | None = None,
) -> DataFrame | Iterator[DataFrame]:
```

In [15]:
conn =  cx_Oracle.connect('ai', '0000', 'localhost:1521/XE')
if bool(conn): print('연결 성공')
else: print('연결 실패')
emp = pd.read_sql('select * from emp', conn)
conn.close()
emp

연결 성공

    EMPNO   ENAME        JOB     MGR   HIREDATE     SAL    COMM  DEPTNO
0    7369   SMITH      CLERK  7902.0 1980-12-17   800.0     NaN      20
1    7499   ALLEN   SALESMAN  7698.0 1981-02-20  1600.0   300.0      30
2    7521    WARD   SALESMAN  7698.0 1981-02-22  1250.0   500.0      30
3    7566   JONES    MANAGER  7839.0 1981-04-02  2975.0     NaN      20
4    7654  MARTIN   SALESMAN  7698.0 1981-09-28  1250.0  1400.0      30
5    7698   BLAKE    MANAGER  7839.0 1981-05-01  2850.0     NaN      30
6    7782   CLARK    MANAGER  7839.0 1981-06-09  2450.0     NaN      10
7    7788   SCOTT    ANALYST  7566.0 1987-07-13  3000.0     NaN      20
8    7839    KING  PRESIDENT     NaN 1981-11-17  5000.0     NaN      10
9    7844  TURNER   SALESMAN  7698.0 1981-09-08  1500.0     0.0      30
10   7876   ADAMS      CLERK  7788.0 1987-07-13  1100.0     NaN      20
11   7900   JAMES      CLERK  7698.0 1981-12-03   950.0     NaN      30
12   7902    FORD    ANALYST  7566.0 1981-12-03  3000.0     NaN      20
13   7934  MILLER      CLERK  7782.0 1982-01-23  1300.0     NaN      10

## DB 신 문법 sqlalchemy

In [30]:
from sqlalchemy import create_engine, text

engine = create_engine("oracle+cx_oracle://ai:0000@localhost:1521/XE")
conn = engine.connect().execution_options(autocommit=True)
test_jeju = pd.read_sql_query(text("select * from emp"), con=conn)
conn.close()
engine.dispose()
test_jeju

    empno   ename        job     mgr   hiredate     sal    comm  deptno
0    7369   SMITH      CLERK  7902.0 1980-12-17   800.0     NaN      20
1    7499   ALLEN   SALESMAN  7698.0 1981-02-20  1600.0   300.0      30
2    7521    WARD   SALESMAN  7698.0 1981-02-22  1250.0   500.0      30
3    7566   JONES    MANAGER  7839.0 1981-04-02  2975.0     NaN      20
4    7654  MARTIN   SALESMAN  7698.0 1981-09-28  1250.0  1400.0      30
5    7698   BLAKE    MANAGER  7839.0 1981-05-01  2850.0     NaN      30
6    7782   CLARK    MANAGER  7839.0 1981-06-09  2450.0     NaN      10
7    7788   SCOTT    ANALYST  7566.0 1987-07-13  3000.0     NaN      20
8    7839    KING  PRESIDENT     NaN 1981-11-17  5000.0     NaN      10
9    7844  TURNER   SALESMAN  7698.0 1981-09-08  1500.0     0.0      30
10   7876   ADAMS      CLERK  7788.0 1987-07-13  1100.0     NaN      20
11   7900   JAMES      CLERK  7698.0 1981-12-03   950.0     NaN      30
12   7902    FORD    ANALYST  7566.0 1981-12-03  3000.0     NaN      20
13   7934  MILLER      CLERK  7782.0 1982-01-23  1300.0     NaN      10

## DB에 넣기
테이블이 없으면 알아서 만들어줌
테이블명 중복이면 오라클은 에러 다른DB는 추가가능
```
def to_sql(
        self,
        name: str, # TABLE이름
        con,
        if_exists: str = "fail", # 테이블이름 중복 ㄴㄴ
        
        schema: str | None = None,
        index: bool_t = True,
        index_label: IndexLabel = None,
        chunksize: int | None = None,
        dtype: DtypeArg | None = None,
        method: str | None = None,
    )
```

In [16]:
conn =  cx_Oracle.connect('ai', '0000', 'localhost:1521/XE')
if bool(conn): print('연결 성공')
else: print('연결 실패')
# df.to_sql(name='test_jeju', con=conn)
# 이거 이제 에러남 ㅋ_ㅋ
# sqlalchemy conn으로 대체
conn.close()

연결 성공

Execution failed on sql 'SELECT name FROM sqlite_master WHERE type='table' AND name=?;': ORA-01036: illegal variable name/number

https://docs.sqlalchemy.org/en/14/dialects/oracle.html

오라클 파일용량 늘리기

DatabaseError: (cx_Oracle.DatabaseError) ORA-01658: unable to create INITIAL extent for segment in tablespace SYSTEM
SELECT * FROM DBA_DATA_FILES;
ALTER DATABASE DATAFILE 'C:\ORACLEXE\APP\ORACLE\ORADATA\XE\SYSTEM.DBF' RESIZE 10000M;
ALTER DATABASE DATAFILE 'C:\ORACLEXE\APP\ORACLE\ORADATA\XE\SYSTEM.DBF' AUTOEXTEND ON MAXSIZE UNLIMITED;

In [33]:
conn = create_engine("oracle+cx_oracle://ai:0000@localhost:1521/XE")
# df.to_sql(name='test_jeju1', con=conn) # Table 'test_jeju' already exists 중복되지않은 이름설정
conn.dispose()